apparentlymart/rust-lpc81x-hal/lpc800-v0.3.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>MRT</name>
			<description>Multi-Rate Timer (MRT)</description>
			<groupName>MRT</groupName>
			<baseAddress>0x40004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>MRT</name>
				<value>10</value>
			</interrupt>
		<registers>						
	<register>					
		<dim>4</dim>				
		<dimIncrement>0x10</dimIncrement>				
		<dimIndex>0-3</dimIndex>				
		<name>INTVAL%s</name>				
		<description>MRT0 Time interval value register. This value is loaded into the TIMER0 register.</description>				
		<addressOffset>0x0</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>IVALUE</name>		
				<description>Time interval load value. This value is loaded into the TIMERn register and the MRTn starts counting down from IVALUE -1. If the timer is idle, writing a non-zero value to this bit field starts the timer immediately.  If the timer is running, writing a zero to this bit field does the following: If LOAD = 1, the timer stops immediately. If LOAD = 0, the timer stops at the end of the time interval.</description>		
				<bitRange>[23:0]</bitRange>		
					
			</field>
			<field>
			<name>RESERVED</name>
			<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
			<bitRange>[30:24]</bitRange>	
			</field>
			<field>			
				<name>LOAD</name>		
				<description>Determines how the timer interval value IVALUE is loaded into the TIMERn register. This bit is write-only. Reading this bit always returns 0.</description>		
				<bitRange>[31:31]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_FORCE_LOAD_THE_L</name>
						<description>No force load. The load from the INTVALn register to the TIMERn register is processed at the end of the time interval if the repeat mode is selected.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>FORCE_LOAD_THE_INTV</name>
						<description>Force load. The INTVALn interval value IVALUE is immediately loaded into the TIMERn register while TIMERn is running.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<dim>4</dim>				
		<dimIncrement>0x10</dimIncrement>				
		<dimIndex>0-3</dimIndex>				
		<name>TIMER%s</name>				
		<description>MRT0 Timer register. This register reads the value of the down-counter.</description>				
		<addressOffset>0x4</addressOffset>				
		<access>read-only</access>				
		<resetValue>0x00FFFFFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>VALUE</name>		
				<description>Holds the current timer value of the down-counter. The initial value is loaded as IVALUE - 1 from the TIME_INTVALn register either at the end of the time interval if the LOAD bit in TIME_INTVALn is 0 and the timer is in repeat mode or immediately if LOAD = 1. When the timer is in idle state, reading this bit fields returns -1 (0x7FFF FFFF).</description>		
				<bitRange>[23:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[31:24]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<dim>4</dim>				
		<dimIncrement>0x10</dimIncrement>				
		<dimIndex>0-3</dimIndex>				
		<name>CTRL%s</name>				
		<description>MRT0 Control register. This register controls the MRT0 modes.</description>				
		<addressOffset>0x8</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>INTEN</name>		
				<description>Enable the TIMERn interrupt.</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLE_</name>
						<description>Disable.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLE_</name>
						<description>Enable.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>MODE</name>		
				<description>Selects timer mode.</description>		
				<bitRange>[2:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>REPEAT_INTERRUPT_MOD</name>
						<description>Repeat interrupt mode.</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ONE_SHOT_INTERRUPT_M</name>
						<description>One-shot interrupt mode.</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ONE_SHOT_BUS_STALL_M</name>
						<description>One-shot bus stall mode.</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RESERVED_</name>
						<description>Reserved.</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[31:3]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<dim>4</dim>				
		<dimIncrement>0x10</dimIncrement>				
		<dimIndex>0-3</dimIndex>				
		<name>STAT%s</name>				
		<description>MRT0 Status register.</description>				
		<addressOffset>0xC</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>INTFLAG</name>		
				<description>Monitors the interrupt flag.</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>NO_PENDING_INTERRUPT</name>
						<description>No pending interrupt. Writing a zero is equivalent to no operation.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>PENDING_INTERRUPT_T</name>
						<description>Pending interrupt. The interrupt is pending because TIMERn has reached the end of the time interval. If the INTEN bit in the CONTROLn is also set to 1, the interrupt for timer channel n and the global interrupt are raised.  Writing a 1 to this bit clears the interrupt request.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RUN</name>		
				<description>Indicates the state of TIMERn. This bit is read-only.</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>IDLE_STATE_TIMERN_I</name>
						<description>Idle state. TIMERn is stopped.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>RUNNING_TIMERN_IS_R</name>
						<description>Running. TIMERn is running.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[31:2]</bitRange>		
					
