apparentlymart/rust-lpc81x-hal/lpc800-v0.3.svd
						</field>
					</fields>
				</register>
				<register>
					<name>COUNT</name>
					<description>Counter register.</description>
					<addressOffset>0xC</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>VALUE</name>
							<description>A write to this register pre-loads start count value into the timer and starts the count-down sequence. A read reflects the current value of the timer.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		
		
		
		
		<peripheral>
	<name>SWM</name>
	<description>Switch matrix (SWM)</description>
	<groupName>SWM</groupName>
	<baseAddress>0x4000C000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
									
<registers>						
	<register>					
		<name>PINASSIGN0</name>				
		<description>Pin assign register 0. Assign movable functions U0_TXD, U0_RXD, U0_RTS, U0_CTS</description>				
		<addressOffset>0x000</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xFFFFFFFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>U0_TXD_O</name>		
				<description>U0_TXD function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>U0_RXD_I</name>		
				<description>U0_RXD function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[15:8]</bitRange>		
			</field>			
			<field>			
				<name>U0_RTS_O</name>		
				<description>U0_RTS function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[23:16]</bitRange>		
			</field>			
			<field>			
				<name>U0_CTS_I</name>		
				<description>U0_CTS function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[31:24]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PINASSIGN1</name>				
		<description>Pin assign register 1. Assign movable functions U0_SCLC, U1_TXD, U1_RXD</description>				
		<addressOffset>0x004</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xFFFFFFFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>U0_SCLK_IO</name>		
				<description>U0_SCLK function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>U1_TXD_O</name>		
				<description>U1_TXD function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[15:8]</bitRange>		
			</field>			
			<field>			
				<name>U1_RXD_I</name>		
				<description>U1_RXD function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[23:16]</bitRange>		
			</field>			
			<field>			
				<name>U1_RTS_O</name>		
				<description>U1_RTS function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[31:24]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PINASSIGN2</name>				
		<description>Pin assign register 2. Assign movable functions U2_TXD, U2_RXD</description>				
		<addressOffset>0x008</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xFFFFFFFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>U1_CTS_I</name>		
				<description>U1_CTS function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>U1_SCLK_IO</name>		
				<description>U1_SCLK function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[15:8]</bitRange>		
			</field>			
			<field>			
				<name>U2_TXD_O</name>		
				<description>U2_TXD function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[23:16]</bitRange>		
			</field>			
			<field>			
				<name>U2_RXD_I</name>		
				<description>U2_RXD function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[31:24]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PINASSIGN3</name>				
		<description>Pin assignregister 3. Assign movable function SPI0_SCK</description>				
		<addressOffset>0x00C</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xFFFFFFFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>U2_RTS_O</name>		
				<description>U2_RTS function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>U2_CTS_I</name>		
				<description>U2_CTS function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[15:8]</bitRange>		
			</field>			
			<field>			
				<name>U2_SCLK_IO</name>		
				<description>U2_SCLK function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[23:16]</bitRange>		
			</field>			
			<field>			
				<name>SPI0_SCK_IO</name>		
				<description>SPI0_SCK function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[31:24]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PINASSIGN4</name>				
		<description>Pin assign register 4. Assign movable functions SPI0_MOSI, SPI0_MISO, SPI0_SSEL, SPI1_SCK</description>				
		<addressOffset>0x010</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xFFFFFFFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>SPI0_MOSI_IO</name>		
				<description>SPI0_MOSI function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>SPI0_MISO_IO</name>		
				<description>SPI0_MISIO function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[15:8]</bitRange>		
			</field>			
			<field>			
				<name>SPI0_SSEL_IO</name>		
				<description>SPI0_SSEL function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[23:16]</bitRange>		
			</field>			
			<field>			
				<name>SPI1_SCK_IO</name>		
				<description>SPI1_SCK function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[31:24]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PINASSIGN5</name>				
		<description>Pin assign register 5. Assign movable functions SPI1_MOSI, SPI1_MISO, SPI1_SSEL, CTIN_0</description>				
		<addressOffset>0x014</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xFFFFFFFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>SPI1_MOSI_IO</name>		
				<description>SPI1_MOSI function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>SPI1_MISO_IO</name>		
				<description>SPI1_MISIO function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[15:8]</bitRange>		
			</field>			
			<field>			
				<name>SPI1_SSEL_IO</name>		
				<description>SPI1_SSEL function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[23:16]</bitRange>		
			</field>			
			<field>			
				<name>CTIN_0_I</name>		
				<description>CTIN_0 function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[31:24]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PINASSIGN6</name>				
		<description>Pin assign register 6. Assign movable functions CTIN_1, CTIN_2, CTIN_3, CTOUT_0</description>				
		<addressOffset>0x018</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xFFFFFFFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>CTIN_1_I</name>		
				<description>CTIN_1 function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>CTIN_2_I</name>		
				<description>CTIN_2function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[15:8]</bitRange>		
			</field>			
			<field>			
				<name>CTIN_3_I</name>		
				<description>CTIN_3 function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[23:16]</bitRange>		
			</field>			
			<field>			
				<name>CTOUT_0_O</name>		
				<description>CTOUT_0 function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[31:24]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PINASSIGN7</name>				
		<description>Pin assign egister 7. Assign movable functions CTOUT_1, CTOUT_2, CTOUT_3, I2C_SDA</description>				
		<addressOffset>0x01C</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xFFFFFFFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>CTOUT_1_O</name>		
				<description>CTOUT_1 function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>CTOUT_2_O</name>		
				<description>CTOUT_2 function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[15:8]</bitRange>		
			</field>			
			<field>			
				<name>CTOUT_3_O</name>		
				<description>CTOUT_3 function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[23:16]</bitRange>		
			</field>			
			<field>			
				<name>I2C_SDA_IO</name>		
				<description>I2C_SDA function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[31:24]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PINASSIGN8</name>				
		<description>Pin assign register 8. Assign movable functions I2C_SCL, ACMP_O, CLKOUT, GPIO_INT_BMAT</description>				
		<addressOffset>0x020</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xFFFFFFFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>I2C_SCL_IO</name>		
				<description>I2C_SCL function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[7:0]</bitRange>		
			</field>			
			<field>			
				<name>ACMP_O_O</name>		
				<description>ACMP_O_O function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[15:8]</bitRange>		
			</field>			
			<field>			
				<name>CLKOUT_O</name>		
				<description>CLKOUT function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[23:16]</bitRange>		
			</field>			
			<field>			
				<name>GPIO_INT_BMAT_O</name>		
				<description>GPIO_INT_BMAT function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_17 (= 0x11).</description>		
				<bitRange>[31:24]</bitRange>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PINENABLE0</name>				
		<description>Pin enable register 0. Enables fixed-pin functions ACMP_I0, ACMP_I1, SWCLK, SWDIO, XTALIN, XTALOUT, RESET, CLKIN, VDDCMP</description>				
		<addressOffset>0x1C0</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x1B3</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>ACMP_I1_EN</name>		
				<description>Enables fixed-pin function. Writing a 1 deselects the function and any movable function can be assigned to this pin. By default the fixed--pin function is deselected and GPIO is assigned to this pin.</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLE_ACMP_I1_THIS</name>
						<description>Enable ACMP_I1. This function is enabled on pin PIO0_0.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLE_ACMP_I1_GPI</name>
						<description>Disable ACMP_I1. GPIO function PIO0_0 (default) or any other movable function can be assigned to pin PIO0_0.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>ACMP_I2_EN</name>		
				<description>Enables fixed-pin function. Writing a 1 deselects the function and any movable function can be assigned to this pin. By default the fixed-pin function is deselected and GPIO is assigned to this pin. Functions CLKIN and ACMP_I2 are connected to the same pin PIO0_1. To use ACMP_I2, disable the CLKIN function in bit 7 of this register and enable ACMP_I2.</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLE_ACMP_I2_THIS</name>
						<description>Enable ACMP_I2. This function is enabled on pin PIO0_1.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLE_ACMP_I2_GPI</name>
						<description>Disable ACMP_I2. GPIO function PIO0_1 (default) or any other movable function can be assigned to pin PIO0_1.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>SWCLK_EN</name>		
				<description>Enables fixed-pin function. Writing a 1 deselects the function and any movable function can be assigned to this pin. This function is selected by default.</description>		
				<bitRange>[2:2]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLE_SWCLK_THIS_F</name>
						<description>Enable SWCLK. This function is enabled on pin PIO0_3.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLE_SWCLK_GPIO_</name>
						<description>Disable SWCLK. GPIO function PIO0_3 is selected on this pin. Any other movable function can be assigned to pin PIO0_3.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>SWDIO_EN</name>		
				<description>Enables fixed-pin function. Writing a 1 deselects the function and any movable function can be assigned to this pin. This function is selected by default.</description>		
				<bitRange>[3:3]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLE_SWDIO_THIS_F</name>
						<description>Enable SWDIO. This function is enabled on pin PIO0_2.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLE_SWDIO_GPIO_</name>
						<description>Disable SWDIO. GPIO function PIO0_2 is selected on this pin. Any other movable function can be assigned to pin PIO0_2.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>XTALIN_EN</name>		
				<description>Enables fixed-pin function. Writing a 1 deselects the function and any movable function can be assigned to this pin. By default the fixed--pin function is deselected and GPIO is assigned to this pin.</description>		
				<bitRange>[4:4]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLE_XTALIN_THIS_</name>
						<description>Enable XTALIN. This function is enabled on pin PIO0_8.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLE_XTALIN_GPIO</name>
						<description>Disable XTALIN. GPIO function PIO0_8 (default) or any other movable function can be assigned to pin PIO0_8.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>XTALOUT_EN</name>		
				<description>Enables fixed-pin function. Writing a 1 deselects the function and any movable function can be assigned to this pin. By default the fixed--pin function is deselected and GPIO is assigned to this pin.</description>		
				<bitRange>[5:5]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLE_XTALOUT_THIS</name>
						<description>Enable XTALOUT. This function is enabled on pin PIO0_9.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLE_XTALOUT_GPI</name>
						<description>Disable XTALOUT. GPIO function PIO0_9 (default) or any other movable function can be assigned to pin PIO0_9.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESET_EN</name>		
				<description>Enables fixed-pin function. Writing a 1 deselects the function and any movable function can be assigned to this pin. This function is selected by default.</description>		
				<bitRange>[6:6]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLE_RESET_THIS_F</name>
						<description>Enable RESET. This function is enabled on pin PIO0_5.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLE_RESET_GPIO_</name>
						<description>Disable RESET. GPIO function PIO0_5 is selected on this pin. Any other movable function can be assigned to pin PIO0_5.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>CLKIN</name>		
				<description>Enables fixed-pin function. Writing a 1 deselects the function and any movable function can be assigned to this pin. By default the fixed-pin function is deselected and GPIO is assigned to this pin. Functions CLKIN and ACMP_I2 are connected to the same pin PIO0_1. To use CLKIN, disable ACMP_I2 in bit 1 of this register and enable CLKIN.</description>		
				<bitRange>[7:7]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLE_CLKIN_THIS_F</name>
						<description>Enable CLKIN. This function is enabled on pin PIO0_1.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLE_CLKIN_GPIO_</name>
						<description>Disable CLKIN. GPIO function PIO0_1 (default) or any other movable function can be assigned to pin CLKIN.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>VDDCMP</name>		
				<description>Enables fixed-pin function. Writing a 1 deselects the function and any movable function can be assigned to this pin. By default the fixed--pin function is deselected and GPIO is assigned to this pin.</description>		
				<bitRange>[8:8]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>ENABLE_VDDCMP_THIS_</name>
						<description>Enable VDDCMP. This function is enabled on pin PIO0_6.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>DISABLE_VDDCMP_GPIO</name>
						<description>Disable VDDCMP. GPIO function PIO0_6 (default) or any other movable function can be assigned to pin PIO0_6.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[31:9]</bitRange>		
						
