apparentlymart/rust-lpc81x-hal/lpc800-v0.3.svd
						</field>			
					</fields>				
				</register>					
			</registers>						
			
			
		</peripheral>
		
		<peripheral>
	<name>CMP</name>
	<description>Analog comparator</description>
	<groupName>CMP</groupName>
	<baseAddress>0x40024000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>CMP</name>
	<value>11</value>
	</interrupt>
	<registers>
		<register>
			<name>CTRL</name>
			<description>Comparator control register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Write as 0.</description>
					<bitRange>[2:0]</bitRange>
					
				</field>
				<field>
					<name>EDGESEL</name>
					<description>This field controls which edges on the comparator output set the COMPEDGE bit (bit 23 below): 00 = Falling edges 01 = Rising edges 1x = Both edges</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>FALLING_EDGES</name>
							<description>Falling edges</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGES</name>
							<description>Rising edges</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_EDGES_2</name>
							<description>Both edges</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BOTH_EDGES_3</name>
							<description>Both edges</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Write as 0.</description>
					<bitRange>[5:5]</bitRange>
					
				</field>
				<field>
					<name>COMPSA</name>
					<description>Comparator output control</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DIRECT</name>
							<description>Comparator output  is used directly.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SYNCH</name>
							<description>Comparator output is synchronized to the bus clock for output to other modules.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Write as 0.</description>
					<bitRange>[7:7]</bitRange>
					
				</field>
				<field>
					<name>COMP_VP_SEL</name>
					<description>Selects positive voltage input</description>
					<bitRange>[10:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VOLTAGE_LADDER_OUTPU</name>
							<description>Voltage ladder output</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I1</name>
							<description>ACMP_I1</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I2</name>
							<description>ACMP_I2</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERNAL_REFERENCE_V</name>
							<description>Internal reference voltage</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>COMP_VM_SEL</name>
					<description>Selects negative voltage input</description>
					<bitRange>[13:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>VOLTAGE_LADDER_OUTPU</name>
							<description>voltage ladder output</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I1</name>
							<description>ACMP_I1</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACMP_I2</name>
							<description>ACMP_I2</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERNAL_REFERENCE_V</name>
							<description>Internal reference voltage</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Write as 0.</description>
					<bitRange>[19:14]</bitRange>
					
				</field>
				<field>
					<name>EDGECLR</name>
					<description>Interrupt clear bit. To clear the COMPEDGE bit and thus negate the interrupt request, toggle the EDGECLR bit by first writing a 1 and then a 0.</description>
					<bitRange>[20:20]</bitRange>
					
				</field>
				<field>
					<name>COMPSTAT</name>
					<description>Comparator status. This bit reflects the state of the comparator output.</description>
					<bitRange>[21:21]</bitRange>
					
