apparentlymart/rust-lpc81x-hal/lpc800-v0.3.svd
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>SYSPLLCTRL</name>				
		<description>System PLL control</description>				
		<addressOffset>0x008</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>MSEL</name>		
				<description>Feedback divider value. The division value M is the programmed MSEL value + 1. 00000: Division ratio M = 1 to 11111: Division ratio M = 32</description>		
				<bitRange>[4:0]</bitRange>		
					
			</field>			
			<field>			
				<name>PSEL</name>		
				<description>Post divider ratio P. The division ratio is 2 x P.</description>		
				<bitRange>[6:5]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>P_EQ_1</name>
						<description>P = 1</description>
						<value>0x0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>P_EQ_2</name>
						<description>P = 2</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>P_EQ_4</name>
						<description>P = 4</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>P_EQ_8</name>
						<description>P = 8</description>
						<value>0x3</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Do not write ones to reserved bits.</description>		
				<bitRange>[31:7]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>SYSPLLSTAT</name>				
		<description>System PLL status</description>				
		<addressOffset>0x00C</addressOffset>				
		<access>read-only</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>LOCK</name>		
				<description>PLL lock status</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>PLL_NOT_LOCKED</name>
						<description>PLL not locked</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>PLL_LOCKED</name>
						<description>PLL locked</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:1]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>SYSOSCCTRL</name>				
		<description>System oscillator control</description>				
		<addressOffset>0x020</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x000</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>BYPASS</name>		
				<description>Bypass system oscillator</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED_OSCILLATOR</name>
						<description>Disabled. Oscillator is not bypassed.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED_PLL_INPUT_</name>
						<description>Enabled. PLL input (sys_osc_clk) is fed directly from the XTALIN pin bypassing the oscillator. Use this mode when using an external clock source instead of the crystal oscillator.</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>FREQRANGE</name>		
				<description>Determines frequency range for Low-power oscillator.</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>1_20_MHZ_FREQUENCY</name>
						<description>1 - 20 MHz frequency range.</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>15_25_MHZ_FREQUENC</name>
						<description>15 - 25 MHz frequency range</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:2]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>WDTOSCCTRL</name>				
		<description>Watchdog oscillator control</description>				
		<addressOffset>0x024</addressOffset>				
		<access>read-write</access>				
		<resetValue>0x0A0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>DIVSEL</name>		
				<description>Select divider for Fclkana.  wdt_osc_clk = Fclkana/ (2 x (1 + DIVSEL)) 00000: 2 x (1 + DIVSEL) = 2 00001: 2 x (1 + DIVSEL) = 4 to 11111: 2 x (1 + DIVSEL) = 64</description>		
				<bitRange>[4:0]</bitRange>		
					
			</field>			
			<field>			
				<name>FREQSEL</name>		
				<description>Select watchdog oscillator analog output frequency (Fclkana).</description>		
				<bitRange>[8:5]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>0_6_MHZ</name>
						<description>0.6 MHz</description>
						<value>0x1</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>1_05_MHZ</name>
						<description>1.05 MHz</description>
						<value>0x2</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>1_4_MHZ</name>
						<description>1.4 MHz</description>
						<value>0x3</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>1_75_MHZ</name>
						<description>1.75 MHz</description>
						<value>0x4</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>2_1_MHZ</name>
						<description>2.1 MHz</description>
						<value>0x5</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>2_4_MHZ</name>
						<description>2.4 MHz</description>
						<value>0x6</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>2_7_MHZ</name>
						<description>2.7 MHz</description>
						<value>0x7</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>3_0_MHZ</name>
						<description>3.0 MHz</description>
						<value>0x8</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>3_25_MHZ</name>
						<description>3.25 MHz</description>
						<value>0x9</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>3_5_MHZ</name>
						<description>3.5 MHz</description>
						<value>0xA</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>3_75_MHZ</name>
						<description>3.75 MHz</description>
						<value>0xB</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>4_0_MHZ</name>
						<description>4.0 MHz</description>
						<value>0xC</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>4_2_MHZ</name>
						<description>4.2 MHz</description>
						<value>0xD</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>4_4_MHZ</name>
						<description>4.4 MHz</description>
						<value>0xE</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>4_6_MHZ</name>
						<description>4.6 MHz</description>
						<value>0xF</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:9]</bitRange>		
					
