apparentlymart/rust-lpc81x-hal/lpc800-v0.3.svd
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>STARTERP1</name>				
		<description>Start logic 1 interrupt wake-up enable register</description>				
		<addressOffset>0x214</addressOffset>				
		<access>read-write</access>				
		<resetValue>0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[11:0]</bitRange>		
					
			</field>			
			<field>			
				<name>WWDT</name>		
				<description>WWDT interrupt wake-up</description>		
				<bitRange>[12:12]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>BOD</name>		
				<description>BOD interrupt wake-up</description>		
				<bitRange>[13:13]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[14:14]</bitRange>		
					
			</field>			
			<field>			
				<name>WKT</name>		
				<description>Self wake-up timer interrupt wake-up</description>		
				<bitRange>[15:15]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>DISABLED</name>
						<description>Disabled</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>ENABLED</name>
						<description>Enabled</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PDSLEEPCFG</name>				
		<description>Power-down states in deep-sleep mode</description>				
		<addressOffset>0x230</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xFFFF</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>BOD_PD</name>		
				<description>BOD power-down control for Deep-sleep and Power-down mode</description>		
				<bitRange>[3:3]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>WDTOSC_PD</name>		
				<description>Watchdog oscillator power-down control for Deep-sleep and Power-down mode. Changing this bit to powered-down has no effect when the LOCK bit in the WWDT MOD register is set. In this case, the watchdog oscillator is always running.</description>		
				<bitRange>[6:6]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[15:7]</bitRange>		
					
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:7]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>PDAWAKECFG</name>				
		<description>Power-down states for wake-up from deep-sleep</description>				
		<addressOffset>0x234</addressOffset>				
		<access>read-write</access>				
		<resetValue>0xEDF0</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>IRCOUT_PD</name>		
				<description>IRC oscillator output wake-up configuration</description>		
				<bitRange>[0:0]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>IRC_PD</name>		
				<description>IRC oscillator power-down wake-up configuration</description>		
				<bitRange>[1:1]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>FLASH_PD</name>		
				<description>Flash wake-up configuration</description>		
				<bitRange>[2:2]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>BOD_PD</name>		
				<description>BOD wake-up configuration</description>		
				<bitRange>[3:3]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved.</description>		
				<bitRange>[4:4]</bitRange>		
					
