apparentlymart/rust-lpc81x-hal/lpc800-v0.3.svd
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Always write these bits as 0b110</description>		
				<bitRange>[14:12]</bitRange>		
					
			</field>			
			<field>			
				<name>ACMP</name>		
				<description>Analog comparator power down</description>		
				<bitRange>[15:15]</bitRange>		
				<enumeratedValues>		
				<name>ENUM</name>		
					<enumeratedValue>	
						<name>POWERED</name>
						<description>Powered</description>
						<value>0</value>
					</enumeratedValue>	
					<enumeratedValue>	
						<name>POWERED_DOWN</name>
						<description>Powered down</description>
						<value>1</value>
					</enumeratedValue>	
				</enumeratedValues>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved</description>		
				<bitRange>[31:16]</bitRange>		
					
			</field>			
		</fields>				
	</register>					
	<register>					
		<name>DEVICE_ID</name>				
		<description>Device ID</description>				
		<addressOffset>0x3F4</addressOffset>				
		<access>read-only</access>				
		<resetValue>0</resetValue>				
		<resetMask>0x00000000</resetMask>				
		<fields>				
			<field>			
				<name>DEVICEID</name>		
				<description>TBD</description>		
				<bitRange>[31:0]</bitRange>		
			</field>			
		</fields>				
	</register>					
</registers>						
										

		</peripheral>
		<peripheral>
	<name>I2C</name>
	<description>I2C-bus interface</description>
	<groupName>I2C</groupName>
	<baseAddress>0x40050000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>I2C</name>
	<value>8</value>
	</interrupt>
	<registers>
		<register>
			<name>CFG</name>
			<description>Configuration for shared functions.</description>
			<addressOffset>0x00</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSTEN</name>
					<description>Master Enable. When disabled, configurations settings for the Master function are not changed, but the Master function is internally reset.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_THE_I2C_MA</name>
							<description>Disabled. The I2C Master function is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_THE_I2C_MAS</name>
							<description>Enabled. The I2C Master function is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SLVEN</name>
					<description>Slave Enable. When disabled, configurations settings for the Slave function are not changed, but the Slave function is internally reset.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_THE_I2C_SL</name>
							<description>Disabled. The I2C slave function is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_THE_I2C_SLA</name>
							<description>Enabled. The I2C slave function is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MONEN</name>
					<description>Monitor Enable. When disabled, configurations settings for the Monitor function are not changed, but the Monitor function is internally reset.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_THE_I2C_MO</name>
							<description>Disabled. The I2C monitor function is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_THE_I2C_MON</name>
							<description>Enabled. The I2C monitor function is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TIMEOUTEN</name>
					<description>I2C bus Time-out Enable. When disabled, timeout flags will be automatically cleared.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_TIME_OUT_F</name>
							<description>Disabled. Time-out function is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_TIME_OUT_FU</name>
							<description>Enabled. Time-out function is enabled. Both types of time-out flags will be generated and will cause interrupts if they are enabled. Typically, only one timeout will be used in a system.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MONCLKSTR</name>
					<description>Monitor function Clock Stretching.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_THE_MONITO</name>
							<description>Disabled. The monitor function will not perform clock stretching. Software may not always be able to read data provided by the monitor function before it is overwritten. This mode may be used when non-invasive monitoring is critical.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED_THE_MONITOR</name>
							<description>Enabled. The monitor function will perform clock stretching in order to ensure that software can read all incoming data supplied by the monitor function.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:5]</bitRange>
					
				</field>
			</fields>
		</register>
		<register>
			<name>STAT</name>
			<description>Status register for Master, Slave, and Monitor functions.</description>
			<addressOffset>0x04</addressOffset>
			<access>read-write</access>
			<resetValue>0x000801</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSTPENDING</name>
					<description>Master Pending. Indicates whether the Master function needs software service. This flag will cause an interrupt when set if enabled via the INTENSET register.  The MSTPENDING flag is automatically cleared when a 1 is written to the MSTCONTINUE bit in the MSTCTL register.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_SERVICE_NEEDED_T</name>
							<description>No service needed. The Master function does not currently need service.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SERVICE_NEEDED_THE_</name>
							<description>Service needed. The Master function needs service. Information on what is needed can be found in the adjacent MSTSTATE field.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MSTSTATE</name>
					<description>Master State code. Each value of this field indicates a specific required service for the Master function.  All other values are reserved.</description>
					<bitRange>[3:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IDLE_THE_MASTER_FUN</name>
							<description>Idle. The Master function is available to be used for a new transaction.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RECEIVE_READY_RECEI</name>
							<description>Receive ready. Received data  available (Master Receiver mode). Address plus Read was previously sent and Acknowledged by slave.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSMIT_READY_DATA</name>
							<description>Transmit ready. Data can be transmitted (Master Transmitter mode). Address plus Write was previously sent and Acknowledged by slave.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ADDRESS_SLAVE_NACKE</name>
							<description>Address. Slave Nacked address.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DATA_SLAVE_NACKED_T</name>
							<description>Data. Slave Nacked transmitted data.</description>
							<value>0x4</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MSTARBLOSS</name>
					<description>Master Arbitration Loss flag. This flag can be cleared by software writing a 1 to this bit. It is also cleared automatically a 1 is written to MSTCONTINUE.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_LOSS_NO_ARBITRAT</name>
							<description>No loss. No Arbitration Loss has occurred.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ARBITRATION_LOSS_TH</name>
							<description>Arbitration loss. The Master function has experienced an Arbitration Loss. At this point, the Master function has already stopped driving the bus and gone to an idle state. Software can respond by doing nothing, or by sending a Start in order to attempt to gain control of the bus when it next becomes idle.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[5:5]</bitRange>
					
