apparentlymart/rust-lpc81x-hal/lpc800-v0.3.svd
				</field>
			</fields>
		</register>
		<register>
			<name>INTENCLR</name>
			<description>SPI Interrupt Enable Clear. Writing a 1 to any implemented bit position causes the corresponding bit in INTENSET to be cleared.</description>
			<addressOffset>0x010</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>RXRDYEN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TXRDYEN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXOVEN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>TXUREN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SSAEN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SSDEN</name>
					<description>Writing 1 clears the corresponding bits in the INTENSET register.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:6]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXDAT</name>
			<description>SPI Receive Data</description>
			<addressOffset>0x014</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<readAction>modify</readAction>
			<fields>
				<field>
					<name>RXDAT</name>
					<description>Receiver Data. This contains the next piece of received data. The number of bits that are used depends on the FLen setting in TXCTL / TXDATCTL.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RXSSELN</name>
					<description>Slave Select for receive. This field allows the state of the  SSEL pin to be saved along with received data. The value will reflect the SSEL pin for both master and slave operation. A zero indicates that a slave select is active. The actual polarity of each slave select pin is configured by the related SPOL bit in CFG.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[19:17]</bitRange>
				</field>
				<field>
					<name>SOT</name>
					<description>Start of Transfer flag. This flag will be 1 if this is the first frame after SSEL went from  deasserted to  asserted (i.e., any previous transfer has ended). This information can be used to identify the first piece of data in cases where the frame length is greater than 16 bit.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, the value read from a reserved bit is not defined.</description>
					<bitRange>[31:21]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TXDATCTL</name>
			<description>SPI Transmit Data with Control</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TXDAT</name>
					<description>Transmit Data. This field provides from 1 to 16 bits of data to be transmitted.</description>
					<bitRange>[15:0]</bitRange>
			
				</field>
				<field>
					<name>TXSSELN</name>
					<description>Transmit Slave Select . This field controls what is output for SSEL in master mode.  The active state of the SSEL function is configured by bits in the CFG register.</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SSEL_ASSERTED_</name>
							<description>SSEL  asserted.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSEL_NOT_ASSERTED_</name>
							<description>SSEL not asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[19:17]</bitRange>
			
				</field>
				<field>
					<name>EOT</name>
					<description>End of Transfer. The asserted SSEL will be deasserted at the end of a transfer, and remain so for at least the time specified by the Transfer_delay value in the DLY register.</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SSEL_NOT_DEASSERTED_</name>
							<description>SSEL not deasserted. This piece of data is not treated as the end of a transfer. SSEL will not be deasserted at the end of this data.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSEL_DEASSERTED_THI</name>
							<description>SSEL deasserted. This piece of data is treated as the end of a transfer. SSELs will be deasserted at the end of this piece of data.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EOF</name>
					<description>End of Frame. Between frames, a delay may be inserted, as defined by the Frame_delay value in the DLY register. The end of a frame may not be particularly meaningful if the FRAME_DELAY value = 0. This control can be used as part of the support for frame lengths greater than 16 bits.</description>
					<bitRange>[21:21]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DATA_NOT_EOF_THIS_P</name>
							<description>Data not EOF. This piece of data transmitted is not treated as the end of a frame.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DATA_EOF_THIS_PIECE</name>
							<description>Data EOF. This piece of data is treated as the end of a frame, causing the FRAME_DELAY time to be inserted before subsequent data is transmitted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RXIGNORE</name>
					<description>Receive Ignore. This allows data to be transmitted using the SPI without the need to read unneeded data from the receiver to simplify the transmit process.</description>
					<bitRange>[22:22]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>READ_RECEIVED_DATA_</name>
							<description>Read received data. Received data must be read in order to allow transmission to progress. In slave mode, an overrun error will occur if received data is not read before new data is received.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>IGNORE_RECEIVED_DATA</name>
							<description>Ignore received data. Received data is ignored, allowing transmission without reading unneeded received data. No receiver flags are generated.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[23:23]</bitRange>
			
