apparentlymart/rust-lpc81x-hal/lpc800-v0.3.svd
	<register>					
		<name>INTSTAT</name>				
		<description>Interrupt status register. Reflects interrupts that are currently enabled.</description>				
		<addressOffset>0x024</addressOffset>				
		<access>read-only</access>				
		<resetValue>0x0005</resetValue>				
		<resetMask>0xFFFFFFFF</resetMask>				
		<fields>				
			<field>			
				<name>RXRDY</name>		
				<description>Receiver Ready flag.</description>		
				<bitRange>[0:0]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Read value is undefined, only zero should be written.</description>		
				<bitRange>[1:1]</bitRange>		
			</field>			
			<field>			
				<name>TXRDY</name>		
				<description>Transmitter Ready flag.</description>		
				<bitRange>[2:2]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Read value is undefined, only zero should be written.</description>		
				<bitRange>[4:3]</bitRange>		
			</field>			
			<field>			
				<name>DELTACTS</name>		
				<description>This bit is set when a change in the state of the CTS input is detected.</description>		
				<bitRange>[5:5]</bitRange>		
			</field>			
			<field>			
				<name>TXDISINT</name>		
				<description>Transmitter Disabled Interrupt flag.</description>		
				<bitRange>[6:6]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Read value is undefined, only zero should be written.</description>		
				<bitRange>[7:7]</bitRange>		
			</field>			
			<field>			
				<name>OVERRUNINT</name>		
				<description>Overrun Error interrupt flag.</description>		
				<bitRange>[8:8]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Read value is undefined, only zero should be written.</description>		
				<bitRange>[10:9]</bitRange>		
			</field>			
			<field>			
				<name>DELTARXBRK</name>		
				<description>This bit is set when a change in the state of receiver break detection occurs.</description>		
				<bitRange>[11:11]</bitRange>		
			</field>			
			<field>			
				<name>START</name>		
				<description>This bit is set when a start is detected on the receiver input.</description>		
				<bitRange>[12:12]</bitRange>		
			</field>			
			<field>			
				<name>FRAMERRINT</name>		
				<description>Framing Error interrupt flag.</description>		
				<bitRange>[13:13]</bitRange>		
			</field>			
			<field>			
				<name>PARITYERRINT</name>		
				<description>Parity Error interrupt flag.</description>		
				<bitRange>[14:14]</bitRange>		
			</field>			
			<field>			
				<name>RXNOISEINT</name>		
				<description>Received Noise interrupt flag.</description>		
				<bitRange>[15:15]</bitRange>		
			</field>			
			<field>			
				<name>RESERVED</name>		
				<description>Reserved. Read value is undefined, only zero should be written.</description>		
				<bitRange>[31:16]</bitRange>		
			</field>			
		</fields>				
	</register>					
</registers>						

		</peripheral>
		<peripheral derivedFrom="USART0">
			<name>USART1</name>
			<baseAddress>0x40068000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART1</name>
				<value>4</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="USART0">
			<name>USART2</name>
			<baseAddress>0x4006C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART2</name>
				<value>5</value>
			</interrupt>
		</peripheral>

		<peripheral>
			<name>CRC</name>
			<description>Cyclic Redundancy Check (CRC) engine</description>
			<groupName>CRC</groupName>
			<baseAddress>0x50000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MODE</name>
					<description>CRC mode register</description>
					<addressOffset>0x00</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_POLY</name>
							<description>CRC polynom: 1X= CRC-32 polynomial 01= CRC-16 polynomial 00= CRC-CCITT polynomial</description>
							<bitRange>[1:0]</bitRange>
						</field>
						<field>
							<name>BIT_RVS_WR</name>
							<description>Data bit order: 1= Bit order reverse for CRC_WR_DATA (per byte) 0= No bit order reverse for CRC_WR_DATA (per byte)</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>CMPL_WR</name>
							<description>Data complement: 1= 1's complement for CRC_WR_DATA 0= No 1's complement for CRC_WR_DATA</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>BIT_RVS_SUM</name>
							<description>CRC sum bit order: 1= Bit order reverse for CRC_SUM 0= No bit order reverse for CRC_SUM</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>CMPL_SUM</name>
							<description>CRC sum complement: 1= 1's complement for CRC_SUM 0=No 1's complement for CRC_SUM</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>Reserved</name>
							<description>Always 0 when read</description>
							<bitRange>[31:6]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SEED</name>
					<description>CRC seed register</description>
					<addressOffset>0x04</addressOffset>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_SEED</name>
							<description>A write access to this register will load CRC seed value to CRC_SUM register with selected bit order and 1's complement pre-processes. A write access to this register will overrule the CRC calculation in progresses.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SUM</name>
					<description>CRC checksum register</description>
					<addressOffset>0x08</addressOffset>
					<access>read-only</access>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_SUM</name>
							<description>The most recent CRC sum can be read through this register with selected bit order and 1's complement post-processes.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>WR_DATA</name>
					<description>CRC data register</description>
					<alternateRegister>SUM</alternateRegister>
					<addressOffset>0x08</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CRC_WR_DATA</name>
							<description>Data written to this register will be taken to perform CRC calculation with selected bit order and 1's complement pre-process. Any write size 8, 16 or 32-bit are allowed and accept back-to-back transactions.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
